Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/mortgage_arrears/aid_and_advice_scheme.html.txt.tmx
Source language: en
Languages: ga

source: Abhaile - free mortgage arrears support
ga: Riaráistí morgáiste: scéim cúnaimh agus comhairle

source: • What services are provided?
ga: • Cén seirbhísí a sholáthraítear?

source: If you are in serious mortgage arrears on your home, if you are unable to pay your debts, and if your mortgage lender has begun to take legal action, you may be able to access the Abhaile scheme for borrowers in home mortgage arrears
ga: Má tá riaráistí tromchúiseacha morgáiste agat ar do theach, mura bhfuil tú in ann d’fhiachas a íoc, agus má chuir d’iasachtóir morgáiste tús le caingean dlí, b’fhéidir go mbeidh tú in ann rochtain a fháil ar an Scéim Cúnaimh agus Comhairle d’iasachtaithe a bhfuil riaráistí morgáiste tí acu

source: This scheme provides a range of services to help you to deal with your situation, including financial advice, legal advice and insolvency advice
ga: Soláthraíonn an Scéim seo réimse seirbhísí chun cabhrú leat déileáil le do chás, comhairle airgeadais, comhairle dlí agus comhairle dócmhainneachta ina measc

source: Abhaile is coordinated by the Department of Justice and Equality and the Department of Social Protection and is operated by the Money Advice and Budgeting Service (MABS) in conjunction with the Insolvency Service of Ireland (ISI), the Legal Aid Board and the Citizens Information Board
ga: Déanann an Roinn Dlí agus Cirt agus Comhionannais agus an Roinn Coimirce Sóisialaí í a comhordú agus déanann an tSeirbhís Bhuiséadta agus Chomhairle Airgid (an SBCA) í a oibriú i gcomhar le Seirbhís Dócmhainneachta na hÉireann (SDÉ), an Bord um Chúnamh Dlíthiúil agus an Bord um Fhaisnéis do Shaoránaigh

source: Panels of qualified and regulated professionals have been set up to provide services under the Scheme
ga: Socraíodh painéil de ghairmithe cáilithe agus rialaithe chun seirbhísí a sholáthar faoin Scéim

source: MABS also has a network of Dedicated Mortgage Arrears (DMA) advisers to provide independent expert advice to people in difficulty with mortgage arrears
ga: Tá líonra de chomhairleoirí Tiomnaithe Riaráistí Morgáiste (TRM) ag an SBCA chun comhairle neamhspleách shaineolach a sholáthar do dhaoine a bhfuil deacrachtaí acu le riaráistí morgáiste

source: You will be eligible for advice and assistance under the Scheme if:
ga: Beidh tú incháilithe chun comhairle agus cúnamh a fháil faoin Scéim sna cásanna a leanas:

source: • You are insolvent – this means that you are unable to pay your debts in full as they fall due and
ga: • Tá tú dócmhainneach – ciallaíonn seo nach bhfuil ar do chumas d’fhiachas ina iomláine a íoc faoi mar a bhíonn siad le híoc, agus

source: • You are in mortgage arrears on your home and
ga: • Tá riaráistí morgáiste agat ar do theach, agus

source: • You are at risk of losing your home (for example, if your mortgage lender has initiated repossession proceedings or indicated that they plan to do so; if they have said that they consider you to be non-cooperating; or if they have asked you to consider selling or surrendering your home)
ga: • Tá tú i mbaol do theach a chailleadh (mar shampla, má chuir d’iasachtóir tús le himeachtaí athshealbhaithe nó má thug siad le fios go mbeartaíonn siad amhlaidh a dhéanamh; má dúirt siad go measann siad nach bhfuil tú ag comhoibriú; nó má d’iarr siad ort machnamh a dhéanamh ar do theach a dhíol nó a thabhairt suas)

source: However, even if the above conditions are satisfied, you will not be eligible for the Scheme if your home is disproportionate to your reasonable living accommodation needs, as set out at section 104 of the Personal Insolvency Act 2012
ga: Fiú má shásaítear na coinníollacha thuas, áfach, ní bheidh tú incháilithe don Scéim má tá an teach díréireach i dtaobh do riachtanais réasúnta cóiríocht mhaireachtála, faoi mar a leagtar amach ag alt 104 den Acht um Dhócmhainneacht Phearsanta, 2012

source: If your mortgage arrears relate only to a buy-to-let property, you are not covered by the Scheme
ga: Mura mbaineann do riaráistí morgáiste ach le maoin a cheannaítear le ligean ar cíos, níl tú cumhdaithe ag an Scéim

source: However, if you are in mortgage arrears on your home, and you also own a buy-to-let, you will still be eligible if you satisfy the above conditions
ga: Má tá riaráistí morgáiste agat ar do theach, áfach, agus má tá maoin a cheannaítear le ligean ar cíos agat chomh maith, beidh tú incháilithe fós féin, má shásaíonn tú na coinníollacha thuas

source: You are eligible for the Personal Insolvency Court Review Service under the Scheme (see below) if you are insolvent and in mortgage arrears and your creditors have rejected your proposal for a Personal Insolvency Arrangement (PIA) that included your home
ga: Tá tú incháilithe don tSeirbhís Athbhreithnithe Cúirte um Dhócmhainneacht Phearsanta má bhí tú dócmhainneach agus má bhí riaráistí morgáiste agat agus má dhiúltaigh do chreidiúnaithe do thogra do Shocrú um Dhócmhainneacht Phearsanta (SDP) lenar áiríodh do bhaile

source: What services are provided?
ga: Cén seirbhísí a sholáthraítear?

source: There are 5 separate advice and assistance services available under the Scheme, as follows:
ga: Tá na 5 sheirbhís chomhairle agus chúnaimh ar leith a leanas ar fáil faoin Scéim:

source: Personal Insolvency Practitioner (PIP) service
ga: Seirbhís Chleachtóra um Dhócmhainneacht Phearsanta (CDP)

source: A panel of Personal Insolvency Practitioners (pdf) has been set up under the Scheme
ga: Bunaíodh painéal de Chleachtóirí um Dhócmhainneacht Phearsanta (pdf) faoin Scéim

source: If you wish to explore your options under personal insolvency, MABS can give you a voucher for free advice and help from one of these PIPs
ga: Más mian leat do chuid roghanna faoi dhócmhainneacht phearsanta a fhiosrú, féadfaidh an SBCA dearbhán a thabhairt duit do chomhairle agus do chabhair saor in aisce ó cheann de na CDPanna seo

source: You can choose your PIP from the Scheme panel, subject to availability
ga: Féadfaidh tú do CDP a roghnú ó phainéal na Scéime, faoi réir fáil a bheith orthu

source: The voucher will entitle you to a face-to-face consultation with a PIP
ga: Bronnfaidh an dearbhán an teidlíocht ort comhairliúchán duine ar dhuine a bheith agat le CDP

source: The PIP will carry out a full assessment of your financial situation, explain all the available options and the best option for you to deal with your mortgage arrears, and confirm that advice to you in writing
ga: Tabharfaidh an CDP faoi mheasúnú iomlán ar do chás airgeadais, míneoidh sé/sí duit na roghanna go léir atá ar fáil agus an rogha is fearr duit chun déileáil le do riaráistí morgáiste, an chomhairle sin a dheimhniú duit i scríbhinn

source: The PIP will also prepare a Prescribed Financial Statement (PFS) with you
ga: Chomh maith leis sin, ullmhóidh an CDP Ráiteas Airgeadais Forordaithe (RAF) leat

source: This is a detailed written analysis of your financial situation, as required under the personal insolvency legislation
ga: Is ionann seo agus anailís mhionsonraithe scríofa ar do chás airgeadais, faoi mar a cheanglaítear faoin reachtaíocht um dhócmhainneacht phearsanta

source: If the PIP advises that your best option is personal insolvency, they will help you in taking the next steps
ga: Má chuireann an CDP in iúl duit gurb é an rogha is fearr atá agat ná dócmhainneacht phearsanta, cabhróidh siad leat chun na chéad chéimeanna eile a ghlacadh

source: If they advise that your best option is bankruptcy, they will also provide you with the certificate required by the bankruptcy court, confirming that you have been advised regarding your options under personal insolvency
ga: Má mholann siad gurb é an rogha is fearr duit ná féimeacht, soláthróidh siad an deimhniú duit a theastaíonn ón gcúirt féimheachta, chomh maith, a dheimhníonn gur cuireadh ar an eolas thú faoin do roghanna faoi dhócmhainneacht phearsanta

source: If your case involves complicated financial issues, but is not suited to personal insolvency, MABS can give you a voucher for free financial advice from an accountant under the Scheme
ga: Má bhaineann saincheisteanna casta airgeadais le do chás, ach mura n-oireann siad do dhócmhainneacht phearsanta, féadfaidh an SBCA dearbhán a thabhairt duit le haghaidh comhairle airgeadais saor in aisce ó chuntasóir eile faoin Scéim

source: A new accountancy panel is being set up, listing accountants who participate in the Scheme
ga: Tá painéal cuntasaíochta nua á bhunú, ina liostaítear cuntasóirí a ghlacann páirt sa Scéim

source: You can choose your accountant from this panel, subject to availability
ga: Féadfaidh tú do chuntasóir a roghnú ón bpainéal seo, faoi réir fáil a bheith orthu

source: You will first need to work with a MABS adviser to complete the Standard Financial Statement (SFS) that lenders require under the Mortgage Arrears Resolution Process (MARP)
ga: Beidh ort oibriú le comhairleoir an SBCA i dtosach chun an Ráiteas Caighdeánach Airgeadais (RCA) a chomhlánú a theastaíonn ó iasachtaithe faoin bPróiseas Réitigh Riaráistí Morgáiste (PRRM)

source: The accountant will need a copy of this statement in order to give you financial advice
ga: Teastóidh cóip den ráiteas seo ón gcuntasóir, d’fhonn comhairle airgeadais a sholáthar duit

source: The voucher will entitle you to a face-to-face consultation with the panel accountant
ga: Bronnfaidh an dearbhán an teidlíocht ort comhairliúchán duine ar dhuine a bheith agat le cuntasóir painéil

source: The accountant will advise you on any financial issues relating to resolution of your mortgage arrears and advise you on possible solutions, and will confirm that advice to you in writing
ga: Cuirfidh an cuntasóir comhairle ort ar aon saincheisteanna airgeadais a bhaineann le do riaráistí morgáiste a réiteach agus le réitigh fhéideartha, agus déanfaidh sé/sí an chomhairle sin a dheimhniú duit i scríbhinn

source: After you have completed your Prescribed Financial Statement or Standard Financial Statement and received financial advice under the Scheme, your financial adviser (PIP, MABS adviser or accountant) may recommend that you also consult a solicitor if your case raises legal issues
ga: I ndiaidh gur chomhlíon tú do Ráiteas Airgeadais Forordaithe nó do Ráiteas Caighdeánach Airgeadais agus gur cuireadh comhairle airgeadais ort faoin Scéim, féadfaidh do chomhairleoir airgeadais (CDP, comhairleoir nó cuntasóir an SBCA) a mholadh go dtéann tú i gcomhairle le haturnae, chomh maith, má thugann do chás saincheisteanna dlíthiúla chun solais

source: For example, your mortgage lender may have written to you, seeking repossession of your home or proposing that you surrender it
ga: Mar shampla, b’fhéidir gur scríobh d’iasachtóir morgáiste chugat, inar lorgaíodh athshealbhú do thí nó inar beartaíodh go dtugann tú suas é

source: Your financial adviser can apply to MABS for a legal advice voucher on your behalf
ga: Féadfaidh do chomhairleoir airgeadais iarratas a dhéanamh leis an SBCA ar dhearbhán do chomhairle dlí thar do cheann

source: You can then choose a solicitor from the panel that has been set up under the Scheme (subject to availability)
ga: Féadfaidh tú aturnae a roghnú ansin ón bpainéal a bunaíodh faoin Scéim (faoi réir fáil a bheith air/uirthi)

source: The legal advice voucher will entitle you to a face-to-face consultation with a solicitor
ga: Bronnfaidh an dearbhán um chomhairle dlí an teidlíocht ort comhairliúchán duine ar dhuine a bheith agat le haturnae

source: The consultation solicitor will assess and explain your legal position, and will advise you on any repossession proceedings and on any legal issues relating to your mortgage arrears
ga: Measúnóidh agus míneoidh an t-aturnae comhairliúcháin do staid dlí, agus cuirfidh sé/sí comhairle ort ar aon imeachtaí athshealbhaithe agus aon saincheisteanna dlíthiúla a bhaineann le do riaráistí morgáiste

source: The solicitor will also confirm that legal advice to you in writing
ga: Chomh maith leis sin, deimhneoidh an t-aturnae an chomhairle dlí sin duit i scríbhinn

source: If the lender has already issued repossession proceedings, the consultation solicitor may, in certain circumstances, be able to negotiate on your behalf to settle the proceedings out of court
ga: Má d’eisigh an t-iasachtóir imeachtaí athshealbhaithe cheana féin, b’fhéidir go mbeidh an t-aturnae comhairliúcháin in ann, faoi chúinsí áirithe, idirbheartaíocht a dhéanamh thar do cheann chun na himeachtaí a réiteach lasmuigh den chúirt

source: It is important to note that the solicitor will need to see any documents that are relevant in your case, particularly your up-to-date financial statement and any written financial advice that you have received under the Scheme
ga: Is tábhachtach a thabhairt faoi deara go mbeidh ar an aturnae aon cháipéisí a fheiceáil a bhaineann le do chás, go háirithe do ráiteas airgeadais atá cothrom le dáta agus aon chomhairle airgeadais i scríbhinn a fuair tú faoin Scéim

source: If you are facing Circuit Court repossession proceedings, you may be able to get some help at Court from the duty solicitor
ga: Má tá imeachtaí athshealbhaithe sa Chúirt Chuarda i ndán duit, b’fhéidir go mbeidh tú in ann roinnt cabhrach a fháil sa Chúirt ón aturnae dualgais

source: This is a solicitor from the Scheme’s solicitor panel (see above) who is normally on duty at a Circuit Court on repossession hearing dates
ga: Aturnae atá san aturnae dualgais ó phainéal aturnaetha na Scéime (féach thuas) ar gnách go mbíonn sé/sí ar dualgas sa Chúirt Chuarda ar dhátaí éisteachtaí athshealbhaithe

source: You cannot choose the duty solicitor, as the Legal Aid Board assigns solicitors from the panel to attend on particular dates
ga: Ní féidir leat an t-aturnae dualgais a roghnú, mar gheall go sannann an Bord um Chúnamh Dlíthiúil aturnaetha ón bpainéal chun freastal ar an gcúirt ar dhátaí ar leith

source: The duty solicitor service is a limited service to provide advice and help to unrepresented borrowers at court
ga: Seirbhís theoranta is ea seirbhís an aturnae dualgais chun comhairle agus cabhair a sholáthar d’iasachtaithe a ndéantar tearcionadaíocht dóibh sa chúirt

source: Your consultation solicitor will explain this in more detail
ga: Míneoidh d’aturnae comhairliúcháin seo duit le níos mó sonraí

source: Normally, you should already have obtained written financial and legal advice under the Scheme, including advice from the consultation solicitor on any repossession proceedings
ga: De ghnáth, ba cheart go bhfuair tú comhairle scríofa airgeadais agus dlí faoin Scéim cheana féin, comhairle ón aturnae comhairliúcháin ar aon imeachtaí athshealbhaithe ina measc

source: If you have not applied in time to get such advice, the duty solicitor may still be able to give you some more limited help, but only if you have already applied to MABS
ga: Mura ndearna tú iarratas go tráthúil chun an chomhairle sin a fháil, b’fhéidir go mbeidh an t-aturnae dualgais fós in ann roinnt cabhair bhreise theoranta a thabhairt duit, ach amháin má tá iarratas déanta agat ar an SBCA cheana féin

source: If your mortgage lender has already issued repossession proceedings against your home, and you have not yet applied for the Scheme, you should contact MABS as soon as possible – see ‘Where to apply’ below
ga: Má tá imeachtaí athshealbhaithe eisithe ag d’iasachtóir morgáiste cheana féin in aghaidh do thí, agus mura ndearna tú iarratas go fóill ar an Scéim, ba cheart duit teagmháil a dhéanamh leis an SBCA a luaithe agus is féidir – féach ‘Cá ndéanfaidh mé iarratas? ’ thíos

source: The duty solicitor may be able to speak for you in Court, to explain what steps you are taking to try and deal with your mortgage arrears, and may be able to apply for the proceedings to be adjourned if you are trying to put a solution in place
ga: B’fhéidir go mbeidh an t-aturnae dualgais in ann labhairt ar do shon sa Chúirt, a mhíniú cén bearta atá á nglacadh agat chun iarracht a dhéanamh déileáil le do riaráistí morgáiste, agus b’fhéidir go mbeidh sé/sí in ann iarratas a dhéanamh ar na himeachtaí a chur ar athló má tá iarracht a déanamh agat chun réiteach a chur i bhfeidhm

source: They may also be able to explain to you what is happening in the proceedings
ga: Chomh maith leis sin, b’fhéidir go mbeidh siad in ann a mhíniú duit cad atá ag tarlú sna himeachtaí

source: However, they may be helping several Scheme borrowers in court on that day, so you should attend well in advance of the time shown on the Court papers, and you should ask for MABS when you arrive
ga: B’fhéidir go bhfuil siad ag cabhrú le roinnt iasachtaithe Scéime sa chúirt ar an lá sin, mar sin, ba cheart duit freastal ar an gCúirt i bhfad níos luaithe ná an t-am a thaispeántar ar pháipéir na Cúirte, agus ba cheart duit fios a chur ar an SBCA ar theacht duit

source: (MABS advisers also attend at the Circuit Court on repossession hearing dates, to provide information and support
ga: (Chomh maith leis sin, freastalaíonn comhairleoirí an SBCA ar an gCúirt Chuarda ar dhátaí éisteachta athshealbhaithe, chun faisnéis agus tacaíocht a sholáthar

source: However, they cannot give legal advice or speak for you in Court.)
ga: Ní féidir leo comhairle dlí ná labhairt ar do shon sa Chúirt, áfach.)

source: The duty solicitor cannot act as your legal aid solicitor or defend the repossession proceedings on your behalf
ga: Ní féidir leis an aturnae dualgais gníomhú mar d’aturnae cúnaimh dlí, ná na himeachtaí athshealbhaithe a chosaint thar do cheann

source: This Scheme does not cover legal aid for defending repossession proceedings
ga: Ní chumhdaíonn an Scéim seo cúnamh dlí chun imeachtaí athshealbhaithe a chosaint

source: If you have a valid legal defence to the repossession and want to apply for legal aid, you should apply for that to the Legal Aid Board, separately from this Scheme
ga: Ma tá cosaint bhailí dhlíthiúil agat i leith an athshealbhaithe agus más mian leat iarratas a dhéanamh ar chúnamh dlí, ba cheart duit iarratas a dhéanamh air sin leis an mBord um Chúnamh Dlíthiúil, ar leithligh ón Scéim seo

source: Personal insolvency court review service
ga: An tseirbhís athbhreithnithe cúirte um dhócmhainneacht phearsanta

source: If you have already worked with a PIP and have proposed a Personal Insolvency Arrangement (PIA) to your creditors, but the creditors have refused your proposal, you can ask the Courts to review it
ga: Má d’oibrigh tú cheana féin le CDP agus má bheartaigh tú Socrú um Dhócmhainneacht Phearsanta (CDP) do do chuid creidiúnaithe, ach má dhiúltaigh na creidiúnaithe do thogra, féadfaidh tú iarraidh ar na Cúirteanna chun athbhreithniú a dhéanamh air

source: Under this element of the Aid and Advice Scheme, the Legal Aid Board can provide you with legal representation by a solicitor and barrister in seeking a Court review of your PIA proposal
ga: Faoin ngné seo den Scéim Cúnaimh agus Comhairle, féadfaidh an Bord um Chúnamh Dlíthiúil ionadaíocht dlí a sholáthar duit ag aturnae agus abhcóide nuair a lorgaítear athbhreithniú Cúirte ar do thogra CDP

source: If the Court agrees that the proposal is overall fair and reasonable, using the criteria set out in section 115A of the Personal Insolvency Act 2012, it can impose the proposal on your creditors
ga: Má chomhaontaíonn an Chúirt go bhfuil an togra cóir agus réasúnta ar an iomlán, agus leas á bhaint as na critéir a leagtar amach in alt 115A den Acht um Dhócmhainneacht Phearsanta, 2012, féadfaidh sé/sí an togra a ghearradh ar do chreidiúnaithe

source: Your PIP will apply to the Legal Aid Board for legal representation on your behalf
ga: Déanfaidh do CDP iarratas ar an mBord um Chúnamh Dlíthiúil ar ionadaíocht dlí thar do cheann

source: The PIP must certify to the Board that you have reasonable grounds for seeking the court review and that you satisfy the other conditions for review laid down by the Personal Insolvency Acts 2012 to 2015 (pdf)
ga: Caithfidh an CDP a dheimhniú don Bhord go bhfuil forais réasúnta agat chun an t-athbhreithniú cúirte a lorg agus go sásaíonn tú na coinníollacha eile le haghaidh athbhreithniú a leagtar síos sna hAchtanna um Dhócmhainneacht Phearsanta, 2012 go 2015 (pdf)

source: If the Legal Aid Board is satisfied with the application, it will grant you a Legal Aid Certificate
ga: Má tá an Bord um Chúnamh Dlíthiúil sásta leis an iarratas, deonóidh sé Deimhniú um Chúnamh Dlíthiúil duit

source: You and your PIP can then select a solicitor from the Scheme solicitors’ panel to act on your behalf
ga: Féadfaidh tú féin agus do CDP aturnae a roghnú ó phainéal aturnaetha na Scéime chun gníomhú thar do cheann

source: (Under the Personal Insolvency Acts, it is your PIP who must apply to Court on your behalf for the review.) The Legal Aid Board will normally also cover the cost of a barrister from the Civil Legal Aid barristers’ panel
ga: (Faoi na hAchtanna um Dhócmhainneacht Phearsanta, is é do CDP nach mór iarratas a dhéanamh ar an gCúirt thar do cheann don athbhreithniú.) Is gnách go gcumhdóidh an Bord um Chúnamh Dlíthiúil an costas a bhíonn ar abhcóide ón bpainéal abhcóidí Cúnaimh Dhlíthiúil Shibhialta chomh maith

source: Abhaile services are provided free of charge to eligible borrowers
ga: Soláthraítear an Scéim Cúnaimh agus Comhairle saor in aisce d’iasachtaithe incháilithe

source: Ring the MABS Helpline: 0761 07 2000 (9am - 8pm, Monday - Friday) or contact your local MABS office
ga: Is féidir glao ar Líne Chabhrach an SBCA: 0761 07 2000 (9am - 8pm, ó Luan go hAoine) nó déan teagmháil le hoifig áitiúil an SBCA
